Revit 2024 API
StructuralSectionGeneralI Constructor
 Creates a new instance of Structural Section I Sloped Flange shape with the associated set of parameters, used to attach to structural element.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public StructuralSectionGeneralI(
	double width,
	double height,
	double flangeThickness,
	double flangeThicknessLocation,
	double flangeFillet,
	double flangeToeOfFillet,
	double slopedFlangeAngle,
	double webThickness,
	double webFillet,
	double webToeOfFillet,
	double centroidHorizontal,
	double centroidVertical,
	StructuralSectionAnalysisParams analysisParams
)
Visual Basic
Public Sub New ( _
	width As Double, _
	height As Double, _
	flangeThickness As Double, _
	flangeThicknessLocation As Double, _
	flangeFillet As Double, _
	flangeToeOfFillet As Double, _
	slopedFlangeAngle As Double, _
	webThickness As Double, _
	webFillet As Double, _
	webToeOfFillet As Double, _
	centroidHorizontal As Double, _
	centroidVertical As Double, _
	analysisParams As StructuralSectionAnalysisParams _
)
Visual C++
public:
StructuralSectionGeneralI(
	double width,
	double height,
	double flangeThickness,
	double flangeThicknessLocation,
	double flangeFillet,
	double flangeToeOfFillet,
	double slopedFlangeAngle,
	double webThickness,
	double webFillet,
	double webToeOfFillet,
	double centroidHorizontal,
	double centroidVertical,
	StructuralSectionAnalysisParams^ analysisParams
)
Parameters
width
Type: System.Double
 Section width.
height
Type: System.Double
 Section height, depth.
flangeThickness
Type: System.Double
 Flange Thickness.
flangeThicknessLocation
Type: System.Double
 Flange Thickness Location.
flangeFillet
Type: System.Double
 Flange Fillet - fillet radius at the flange end.
flangeToeOfFillet
Type: System.Double
 Detailing distance from center of web to flange toe of fillet, in. (mm).
slopedFlangeAngle
Type: System.Double
 Sloped flange angle. (rad)
webThickness
Type: System.Double
 Web Thickness.
webFillet
Type: System.Double
 Web Fillet - fillet radius between web and flange.
webToeOfFillet
Type: System.Double
 Detailing distance from outer face of flange to web toe of fillet, in. (mm)
centroidHorizontal
Type: System.Double
 Distance from centroid to the left extremites along horizontal axis.
centroidVertical
Type: System.Double
 Distance from centroid to the upper extremites along vertical axis.
analysisParams
Type: Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams
 Common set of parameters for structural analysis.
See Also
StructuralSectionGeneralI Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace